namespace ChessUniverse.Library;

public struct Coords
{
    // Խաղի տախտակի վրա դիրքը ներկայացնելու համար օգտագործում ենք այս struct-ը, որը ունի երկու հատկություն՝ Row և Col, որոնք ներկայացնում են տախտակի համապատասխան տողը և սյունը
    // օգտագործում ենք struct, քանի որ այն ավելի թեթև է և ավելի արդյունավետ է, քան class-ը

    // կարդում ենք տողը և կարող ենք այն դրսից փոխել
    public int Row { get; set; }

    // կարդում ենք սյունը և կարող ենք այն դրսից փոխել
    public int Col { get; set; }

    // Կոնստրուկտոր, որը ընդունում է տողը և սյունը և վերագրում է դրանք համապատասխան հատկություններին
    public Coords(int row, int col)
    {
        Row = row;
        Col = col;
    }

}
